app/Http/Controllers/User/QuestionController.php

select count(*) as aggregate from `questions` where `questions`.`deleted_at` is null
---
    public function index(QuestionsRequest $request)
    {
        $inputs = $request->all();
        $questions = $this->question->getQuestionRecord($inputs)->paginate(10);