app/Models/Question.php

select * from `comments` where `comments`.`question_id` in (1, 2, 3, 4) and `comments`.`deleted_at` is null
select * from `questions` where `questions`.`deleted_at` is null order by `updated_at` desc limit 10 offset 0
select * from `tag_categories` where `tag_categories`.`id` in (1, 2, 3) and `tag_categories`.`deleted_at` is null
select * from `users` where `users`.`id` in (1, 2, 3, 4) and `users`.`deleted_at` is null
---
    public function getQuestions($data)
    {
        return $this->searchTitle(Arr::get($data,'search_word'))
                    ->searchTagCategoryId(Arr::get($data, 'search_category_id'))
                    ->orderBy('updated_at', 'desc')
                    ->with(['tagCategory', 'user', 'comments'])
                    ->paginate(self::PER_PAGE);

select * from `comments` where `comments`.`question_id` in (4) and `comments`.`deleted_at` is null
select * from `questions` where `user_id` = '4' and `questions`.`deleted_at` is null limit 10 offset 0
select * from `tag_categories` where `tag_categories`.`id` in (3) and `tag_categories`.`deleted_at` is null
select count(*) as aggregate from `questions` where `user_id` = '4' and `questions`.`deleted_at` is null
---
    public function selectMyRecords($userId)
    {
        return $this->where('user_id', $userId)
                    ->with(['tagCategory', 'comments'])
                    ->paginate(self::PER_PAGE);

select * from `questions` where `questions`.`id` = '4' and `questions`.`deleted_at` is null limit 1
select * from `tag_categories` where `tag_categories`.`id` in (3) and `tag_categories`.`deleted_at` is null
select * from `users` where `users`.`id` in (4) and `users`.`deleted_at` is null
---
    public function selectMyRecord($id)
    {
        return $this->with(['tagCategory', 'user'])->find($id);