app/Models/TagCategory.php

    public function tagCategories()
    {
        return $this->all();
---
select * from `tag_categories` where `tag_categories`.`deleted_at` is null